drop database if exists xishu;
create database xishu charset=utf8;
    use xishu;
    set names utf8;
    #创建用户表
    create table user(
            uid int auto_increment primary key,
            userName varchar(20),
            userPwd char(32)
        );
    #加入初始数据,密码为"xishu@admin"
    INSERT INTO user(userName,userPwd) VALUES('admin','35914151fac07bfc6f21f39885c84013');
    #创建设计师表
    create table designers(
            desId int auto_increment primary key,
            desName varchar(20),
            headImg varchar(50),    #头像
            position text,      #职位
            profession text,     #职称
            concept text,        #理念
            WorkingTime tinyint,     #从业时间
            company varchar(50)     #公司
        );
    #加入设计师数据
    INSERT INTO designers(desName,headImg,position,profession,concept,WorkingTime,company) VALUES('艾利','img/upload/艾利.jpg','玺墅设计创始人、设计总监','中国高级室内设计师、中国风水协会会员','活更艺术，让艺术更生活。',16,'玺墅室内设计有限公司'),('王勇','img/upload/王勇.jpg','玺墅首席主创设计师、创始人','新浪家居室内设计顾问、青岛早报特约设计师','设计以人为本，美化空间效果，完善生活功能，倡导实用艺术生活',16,'玺墅室内设计有限公司');
    #创建奖项
    create table awards(
            aid int auto_increment primary key,
            aName varchar(50),
            desid int,
            time bigint
        );
    #加入奖项数据
    INSERT INTO awards(aName,desid,time) VALUES('《品客》杂志顾问设计师',1,1487484918193),('搜房网特邀户型点评设计师',1,1487484918193),('获青岛市首届“十大优秀青年室内设计师”（装饰装修协会）',1,1487484918193),('获全国杰出中青年室内设计师称号（建筑装饰装修协会）',1,1487484918193),('《获中国设计业百人榜成员（光华基金会）2005年',1,1487484918193),('获中国十佳住宅设计师（中国建筑装饰装修协会）2006年',1,1487484918193),('获别墅 “金牌设计师”《典型住宅•别墅世界》2008年',1,1487484918193),('获设计师网络传媒 “杰出设计师”（搜狐焦点网络2010年）师',1,1487484918193),('青岛第九届室内设计大赛，设计作品室内设计银奖2012年',1,1487484918193),('青岛第十届室内设计大赛，设计作品室内设计金奖2013年',1,1487484918193),('获得2015年第六届“国际筑巢”奖 公寓方案类     银奖',1,1487484918193),('获得2016年海博家居杯第13届室内设计大赛       金奖',1,1487484918193),('获得2017年艾特国际空间设计大奖          特别推荐奖',1,1487484918193),('2016年喜舍杯•中国住宅设计总评榜优秀奖',2,1487484918193),('2016第七届筑巢奖优秀奖',2,1487484918193),('2016赴清华大学进修',2,1487484918193),(' 2016 Idea-Tops国际空间设计大奖入围',2,1487484918193),('2015红棉中国设计奖-年度优秀奖',2,1487484918193),('2015艾特奖入围奖',2,1487484918193),('2015芬琳杯设计大赛优秀奖',2,1487484918193),('2014未来之星装修设计大赛（华东赛区）“最佳设计奖”',2,1487484918193),(' 2014老板电器首届厨房空间设计大赛青岛赛区新锐设计奖',2,1487484918193),('2014青岛第十一届室内设计大赛优秀奖',2,1487484918193),('2014年被青岛室内装饰协会评为优秀家居设计师',2,1487484918193),('2014年大自然家居首席设计师',2,1487484918193),('2013-2014年度业之峰装饰内部培训师',2,1487484918193),('2013“美涂士漆杯”业之峰全国室内环保设计精英赛 入围三十强奖',2,1487484918193),('2012年年度风云人物',2,1487484918193),('2012年荣获业之峰装饰十年功勋员工称号',2,1487484918193),('2011年青岛第八届室内设计大赛银奖',2,1487484918193),('2011年第六届大金室内设计大赛入围奖',2,1487484918193),(' 2011”海博家居杯”青岛第八届室内设计大赛“银奖”',2,1487484918193),('2011年被评为九大珠峰设计师之一',2,1487484918193),('2011年通过室内陈列艺术设计师资格认证',2,1487484918193),('2011年全国综合评优活动中，被评为优秀设计师',2,1487484918193),('2010年设计师“峰”采大会评比中荣获合并产值排名全国第四名',2,1487484918193),('《业之峰明星设计师帮你设计家》作品入围',2,1487484918193),(' 2007年通过室内设计师资格认证',2,1487484918193);
    #创建作品表
    create table works(
            wid int auto_increment primary key,
            wName varchar(50),
            type varchar(50),
            desId int
        );
    #加入作品数据
    INSERT INTO works(wName,type,desId) VALUES('弄海园别墅','青岛家装作品',1),('崂山（自建别墅）','青岛家装作品',1),('银都花园（别墅）','青岛家装作品',1),('颐和星苑（别墅）','青岛家装作品',1),('龙湖原山（别墅）','青岛家装作品',1),('青岛小镇（别墅）','青岛家装作品',1),('海上罗兰（别墅）','青岛家装作品',1),('御墅（别墅）','青岛家装作品',1),('百福国际山庄（别墅）','青岛家装作品',1),('香溪庭院（别墅）','青岛家装作品',1),('德郡（别墅）','青岛家装作品',1),('骊山国际（别墅）','青岛家装作品',1),('圣罗尼克（别墅）','青岛家装作品',1),('橄榄树（别墅）','青岛家装作品',1),('水岸豪庭（别墅）','青岛家装作品',1),('莱西（别墅）','青岛家装作品',1),('荣成（别墅）','青岛家装作品',1),('文园（复式）','青岛家装作品',1),('悦海豪庭（复式）','青岛家装作品',1),('海怡翠庭（复式）','青岛家装作品',1),('海逸名都（复式）','青岛家装作品',1),('12府（复式）','青岛家装作品',1),('颐山源墅（平墅）','青岛家装作品',1),('玫瑰园（别墅）','青岛家装作品',1),('玫瑰庭院（别墅）','青岛家装作品',1),('柏丽澜庭（精装改造）','青岛家装作品',1),('青岛高科园金意陶展厅设计','青岛工装作品',1),('青岛明丰德酒店设计','青岛工装作品',1),('青岛创意融合西餐厅设计','青岛工装作品',1),('青岛玺公馆办公设计','青岛工装作品',1),('青岛中心办公室设计','青岛工装作品',1),('青岛樱花日式料理店设计','青岛工装作品',1),('威海宋公馆私人会所设计','青岛工装作品',1),('即墨中和典当行设计','青岛工装作品',1),('弄海园别墅','成功案例',2),('鲁信未央','成功案例',2),('爱琴海公寓','成功案例',2),('悦海豪庭','成功案例',2),('文苑别墅石湾山庄','成功案例',2),('潍坊德馨佳苑别墅（10套)','成功案例',2),('唐岛金湾(5套）','成功案例',2),('骊山国际','成功案例',2),('百福山庄','成功案例',2),('绿城理想之城（6套）','成功案例',2),('茵悦小城','成功案例',2),('迪亚湾','成功案例',2),('德郡别墅','成功案例',2),('保利海上罗兰','成功案例',2);
    #创建案例表
    create table cases(
            caseId int auto_increment primary key,
            casedes int,
            caseName varchar(50),
            caseImg varchar(50)
        );
    #INSERT INTO cases(casedes,caseName) VALUES(1,'2015国际筑巢奖 银奖作品  青岛-12府360 简约'),(1,'2016青岛设计大赛 金奖作品  青岛自建别墅'),(1,'2017国际艾特奖 作品 青岛玫瑰园'),(1,'经典地中海'),(1,'白色地中海'),(1,'走下去-就是加勒比海'),(1,'简约东南亚'),(1,'法式'),(1,'后现代'),(1,'简约浅色'),(1,'简约中色'),(1,'白红'),(1,'D浅色美式'),(1,'深色'),(1,'豪华效果图'),(1,'美式田园'),(1,'简约美式'),(1,'美式深色效果图'),(1,'美式深色'),(1,'欧式深色'),(1,'欧式浅色'),(1,'简约欧式'),(1,'欧式白色1'),(1,'欧式白色2'),(1,'欧式新古典'),(1,'欧式深色2'),(1,'奢华'),(1,'中式传统'),(1,'简中式'),(1,'中式效果图'),(1,'新中式'),(1,'新中式深色'),(1,'中式田园'),(1,'经典中式'),(1,'简约中式'),(1,'中式西作'),(1,'中式明代'),(1,'中式田园2'),(1,'中式竹子主题'),(1,'中式时尚'),(1,'中式雅奢'),(1,'温婉东方情愫');
    INSERT INTO cases(casedes,caseName,caseImg) VALUES(2,'伯爵公馆1楼700平方-新古典','img/upload/cases/bojuegongguan.jpg'),(2,'德馨嘉苑800平米-欧式古典','img/upload/cases/dexinjiayuan.jpg'),(2,'青岛小镇-450平方 -2015-美式','img/upload/cases/qingdaoxiaozhen450.jpg'),(2,'莱州御龙居-460平方-2014-中式','img/upload/cases/laizhouyulongju.jpg'),(2,'颐和绿洲-600平方-2014-欧式','img/upload/cases/yihelvzhou600.jpg'),(2,'颐和星苑-420平方-2015-新中式','img/upload/cases/yihexingyuan420.jpg'),(1,'简约东南亚','img/upload/cases/jianyuedongnanya.jpg'),(1,'法式1套','img/upload/cases/fashi1.jpg'),(1,'后现代1套','img/upload/cases/houxiandai1.jpg'),(1,'奢华1套','img/upload/cases/shehua1.jpg'),(1,'简约浅色','img/upload/cases/jianyueqianse.jpg'),(1,'经典地中海','img/upload/cases/jingdiandizhonghai.jpg'),(1,'白色地中海','img/upload/cases/baisedizhonghai.jpg'),(1,'美式田园','img/upload/cases/meishitianyuan.jpg'),(1,'美式豪华','img/upload/cases/meishihaohua.jpg'),(1,'浅色美式','img/upload/cases/qiansemeishi.jpg'),(1,'简约中色','img/upload/cases/jianyuezhongse.jpg'),(1,'美式白红','img/upload/cases/meishibaihong.jpg'),(1,'美式深色','img/upload/cases/meishishense.jpg'),(1,'欧式深色','img/upload/cases/oushishense.jpg'),(1,'简约欧式','img/upload/cases/jianyueoushi.jpg'),(1,'欧式白色','img/upload/cases/oushibaise.jpg'),(1,'简中式','img/upload/cases/jianzhongshi.jpg'),(1,'中式田园','img/upload/cases/zhongshitianyuan.jpg'),(1,'经典中式','img/upload/cases/jingdianzhongshi.jpg'),(1,'简约中式','img/upload/cases/jianyuezhongshi.jpg'),(1,'中式明代','img/upload/cases/zhongshimingdai.jpg');